---
kind: property
id: P:Autodesk.Revit.DB.Architecture.ContinuousRailType.DefaultJoinOption
source: html/5ad1c0b7-e095-9a16-b94e-3242a28e2a90.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRailType.DefaultJoinOption Property

The default join option between two rails.

## Syntax (C#)
```csharp
public RailTypeDefaultJoinOption DefaultJoinOption { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration